Tekla Open API Reference for Tekla Structures 2025
BendSurfaceNode Class
 The BendSurfaceNode class represents a bend surface geometry tree node.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.BendSurfaceNode
 Tekla.Structures.Model.ConicalSurfaceNode
 Tekla.Structures.Model.CylindricalSurfaceNode
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class BendSurfaceNode : IGeometryNode
<SerializableAttribute>
Public MustInherit Class BendSurfaceNode
	Implements IGeometryNode
The BendSurfaceNode type exposes the following members.
Constructors
Name | Description
BendSurfaceNode
 Initializes a new instance of the BendSurfaceNode class.
Top
Properties
Name | Description
IsAutomatic
 Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)
Surface
 Gets the bend surface geometry.
Top
Methods
Name | Description
AcceptVisitor
 Entry method for the visitor pattern
Clone
 Creates a new object that is a copy of the current instance.
Top
See Also
Reference
Tekla.Structures.Model Namespace